app/controllers/api/v1/ideas_controller.rb

  def index
    @ideas = Idea.order("created_at DESC")
---
SELECT "ideas".* FROM "ideas" ORDER BY created_at DESC

  def create
    @idea = Idea.create(idea_params)
---
INSERT INTO "ideas" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", ""], ["body", ""], ["created_at", "2018-02-16 20:07:59.242032"], ["updated_at", "2018-02-16 20:07:59.242032"]]

  def update
    @idea = Idea.find(params[:id])
    @idea.update_attributes(idea_params)
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
UPDATE "ideas" SET "title" = $1, "updated_at" = $2 WHERE "ideas"."id" = $3  [["title", "hey Rails API!"], ["updated_at", "2018-02-17 13:59:37.419614"], ["id", 19]]

  def destroy
    @idea = Idea.find(params[:id])
    if @idea.destroy
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
DELETE FROM "ideas" WHERE "ideas"."id" = $1  [["id", 23]]